app/views/deals/index.html.erb


          $.ajax('/deals/nearby',{
            type: "GET",
            dataType: "json",
            data: {latitude: position.coords.latitude, longitude: position.coords.longitude},
            success: function(data){
              map_deals(data);
              // console.log(data);
              // console.log(data.length);
              $("#nearby-deals").html("");
              // $("#nearby-deals").html("<table>");
              for(var i =0; i< data.length; i++) {
                $("#nearby-deals").append("<tr>");
                $("#deal-name").append("<b>"+(i+1)+") "+data[i].deal+" </b></td>");
                $("#deal-description").append("<td>"+data[i].description+"</td>");
                $("#deal-countdown").append(dealTimer(data[i].end_time));
                $("#nearby-deals").append("</tr>");
              }
              $("#nearby-deals").append("</table>");
            }
          });
---
SELECT "deals".* FROM "deals"