app/controllers/deals_controller.rb

SELECT "deals".* FROM "deals"
---
  def index
    @deals = Deal.all

INSERT INTO "deals" ("address", "city", "created_at", "deal", "description", "end_time", "latitude", "longitude", "start_time", "state", "street1", "updated_at", "user_id", "zip") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
---
  def create
    @deal = Deal.new(deal_params)

    respond_to do |format|
      if @deal.save

DELETE FROM "deals" WHERE "deals"."id" = ?  [["id", 2]]
---
  def destroy
    @deal.destroy

SELECT deals.*, 3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((40.7056896 - deals.latitude) * PI() / 180 / 2), 2) + COS(40.7056896 * PI() / 180) * COS(deals.latitude * PI() / 180) * POWER(SIN((-74.0076879 - deals.longitude) * PI() / 180 / 2), 2))) AS distance, CAST(DEGREES(ATAN2( RADIANS(deals.longitude - -74.0076879), RADIANS(deals.latitude - 40.7056896))) + 360 AS decimal) % 360 AS bearing FROM "deals" WHERE (start_time <= '2013-12-03 00:06:51.644242' AND end_time >= '2013-12-03 00:06:51.644242') AND (deals.latitude BETWEEN 40.66227006506674 AND 40.749109134933256 AND deals.longitude BETWEEN -74.06496435088941 AND -73.95041144911058 AND 3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((40.7056896 - deals.latitude) * PI() / 180 / 2), 2) + COS(40.7056896 * PI() / 180) * COS(deals.latitude * PI() / 180) * POWER(SIN((-74.0076879 - deals.longitude) * PI() / 180 / 2), 2))) <= 3) ORDER BY distance ASC
---
    def set_deal
      @deal = Deal.find(params[:id])