app/controllers/registrations_controller.rb

  def create
    build_resource(sign_up_params)
    resource.add_role(params[:user][:roles])

    if resource.save
---
INSERT INTO "roles" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Tue, 26 Nov 2013 16:54:36 UTC +00:00], ["name", "vendor"], ["updated_at", Tue, 26 Nov 2013 16:54:36 UTC +00:00]]
INSERT INTO "users" ("address", "city", "created_at", "email", "encrypted_password", "first_name", "latitude", "longitude", "phone", "state", "street1", "updated_at", "zip") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
UPDATE "users" SET "last_sign_in_at" = ?, "current_sign_in_at" = ?, "last_sign_in_ip" = ?, "current_sign_in_ip" = ?, "sign_in_count" = ?, "updated_at" = ? WHERE "users"."id" = 2